package TinkoffCourse.Section6;

import java.util.Scanner;

/**
 * Даны две строки s1 и s2. Требуется найти такую строку z максимальной длины,
 * что z является и подстрокой s1, и подстрокой s2
 */

public class LongestCommonSubsequence {
    public static void main(String[] args) {
        Scanner scanner = new Scanner(System.in);
        System.out.print("String 1: ");
        String str1 = scanner.nextLine();
        System.out.print("String 2: ");
        String str2 = scanner.nextLine();


    }

    public static void greatestCommonString(String str1, String str2) {
        // дописать
    }
}
